
## Plan Result (aat)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 6 to change, 27 to destroy.</code></pre>

* Create
  * module.application_insights.azurerm_monitor_activity_log_alert.main
  * module.ecm-create-updates-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.ecm-update-case-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
* Update
  * azurerm_key_vault_secret.create_updates_queue_listen_conn_str
  * azurerm_key_vault_secret.create_updates_queue_send_conn_str
  * azurerm_key_vault_secret.update_case_queue_listen_conn_str
  * azurerm_key_vault_secret.update_case_queue_send_conn_str
  * azurerm_resource_group.rg
  * module.application_insights.azurerm_application_insights.this
* Delete
  * azurerm_key_vault_secret.ecm_postgres_database
  * azurerm_key_vault_secret.ecm_postgres_host
  * azurerm_key_vault_secret.ecm_postgres_password
  * azurerm_key_vault_secret.ecm_postgres_port
  * azurerm_key_vault_secret.ecm_postgres_user
  * module.ecm-database.azurerm_postgresql_active_directory_administrator.admin
  * module.ecm-database.azurerm_resource_group.data-resourcegroup
  * module.ecm-database.azurerm_template_deployment.postgres-paas
  * module.ecm-database.null_resource.subnet_mappings[0]
  * module.ecm-database.null_resource.subnet_mappings[1]
  * module.ecm-database.null_resource.subnet_mappings[2]
  * module.ecm-database.null_resource.subnet_mappings[3]
  * module.ecm-database.null_resource.subnet_mappings[4]
  * module.ecm-database.null_resource.subnet_mappings[5]
  * module.ecm-database.null_resource.subnet_mappings[6]
  * module.ecm-database.null_resource.subnet_mappings[7]
  * module.ecm-database.null_resource.subnet_mappings[8]
  * module.ecm-database.null_resource.subnet_mappings[9]
  * module.ecm-database.null_resource.subnet_mappings[10]
  * module.ecm-database.null_resource.subnet_mappings[11]
  * module.ecm-database.null_resource.subnet_mappings[12]
  * module.ecm-database.null_resource.subnet_mappings[13]
  * module.ecm-database.random_string.password
* Replace
  * module.ecm-create-updates-queue.azurerm_servicebus_queue.servicebus_queue
  * module.ecm-create-updates-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.ecm-update-case-queue.azurerm_servicebus_queue.servicebus_queue
  * module.ecm-update-case-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.create_updates_queue_listen_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "create_updates_queue_listen_conn_str" {
        id                      = "https://ethos-shared-aat.vault.azure.net/secrets/create-updates-queue-listen-connection-string/8c6df56b40de459f9992e76cd758d893"
        name                    = "create-updates-queue-listen-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.create_updates_queue_send_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "create_updates_queue_send_conn_str" {
        id                      = "https://ethos-shared-aat.vault.azure.net/secrets/create-updates-queue-send-connection-string/7aa9cfb4358f4bd787b58b3d5f7b6087"
        name                    = "create-updates-queue-send-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.ecm_postgres_database will be destroyed
  # (because azurerm_key_vault_secret.ecm_postgres_database is not in configuration)
  - resource "azurerm_key_vault_secret" "ecm_postgres_database" {
      - id                      = "https://ethos-shared-aat.vault.azure.net/secrets/ecm-consumer-postgres-database/5ed24b158e7949a49006be1729609ab2" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat" -> null
      - name                    = "ecm-consumer-postgres-database" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat/secrets/ecm-consumer-postgres-database/versions/5ed24b158e7949a49006be1729609ab2" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat/secrets/ecm-consumer-postgres-database" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "5ed24b158e7949a49006be1729609ab2" -> null
      - versionless_id          = "https://ethos-shared-aat.vault.azure.net/secrets/ecm-consumer-postgres-database" -> null
    }

  # azurerm_key_vault_secret.ecm_postgres_host will be destroyed
  # (because azurerm_key_vault_secret.ecm_postgres_host is not in configuration)
  - resource "azurerm_key_vault_secret" "ecm_postgres_host" {
      - id                      = "https://ethos-shared-aat.vault.azure.net/secrets/ecm-consumer-postgres-host/f7efe1e0110d4407ba48357714b74789" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat" -> null
      - name                    = "ecm-consumer-postgres-host" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat/secrets/ecm-consumer-postgres-host/versions/f7efe1e0110d4407ba48357714b74789" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat/secrets/ecm-consumer-postgres-host" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "f7efe1e0110d4407ba48357714b74789" -> null
      - versionless_id          = "https://ethos-shared-aat.vault.azure.net/secrets/ecm-consumer-postgres-host" -> null
    }

  # azurerm_key_vault_secret.ecm_postgres_password will be destroyed
  # (because azurerm_key_vault_secret.ecm_postgres_password is not in configuration)
  - resource "azurerm_key_vault_secret" "ecm_postgres_password" {
      - id                      = "https://ethos-shared-aat.vault.azure.net/secrets/ecm-consumer-postgres-password/702c0c78123448c39c3689c6715a2e1b" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat" -> null
      - name                    = "ecm-consumer-postgres-password" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat/secrets/ecm-consumer-postgres-password/versions/702c0c78123448c39c3689c6715a2e1b" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat/secrets/ecm-consumer-postgres-password" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "702c0c78123448c39c3689c6715a2e1b" -> null
      - versionless_id          = "https://ethos-shared-aat.vault.azure.net/secrets/ecm-consumer-postgres-password" -> null
    }

  # azurerm_key_vault_secret.ecm_postgres_port will be destroyed
  # (because azurerm_key_vault_secret.ecm_postgres_port is not in configuration)
  - resource "azurerm_key_vault_secret" "ecm_postgres_port" {
      - id                      = "https://ethos-shared-aat.vault.azure.net/secrets/ecm-consumer-postgres-port/1b4ed1ea8d89447f93f2d8e8e0cd43fe" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat" -> null
      - name                    = "ecm-consumer-postgres-port" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat/secrets/ecm-consumer-postgres-port/versions/1b4ed1ea8d89447f93f2d8e8e0cd43fe" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat/secrets/ecm-consumer-postgres-port" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "1b4ed1ea8d89447f93f2d8e8e0cd43fe" -> null
      - versionless_id          = "https://ethos-shared-aat.vault.azure.net/secrets/ecm-consumer-postgres-port" -> null
    }

  # azurerm_key_vault_secret.ecm_postgres_user will be destroyed
  # (because azurerm_key_vault_secret.ecm_postgres_user is not in configuration)
  - resource "azurerm_key_vault_secret" "ecm_postgres_user" {
      - id                      = "https://ethos-shared-aat.vault.azure.net/secrets/ecm-consumer-postgres-user/02ece809aa1f4e6a9c90e29a776a1ff8" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat" -> null
      - name                    = "ecm-consumer-postgres-user" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat/secrets/ecm-consumer-postgres-user/versions/02ece809aa1f4e6a9c90e29a776a1ff8" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.KeyVault/vaults/ethos-shared-aat/secrets/ecm-consumer-postgres-user" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "02ece809aa1f4e6a9c90e29a776a1ff8" -> null
      - versionless_id          = "https://ethos-shared-aat.vault.azure.net/secrets/ecm-consumer-postgres-user" -> null
    }

  # azurerm_key_vault_secret.update_case_queue_listen_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "update_case_queue_listen_conn_str" {
        id                      = "https://ethos-shared-aat.vault.azure.net/secrets/update-case-queue-listen-connection-string/3a33ebc7a47c42988466f103920a77d0"
        name                    = "update-case-queue-listen-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.update_case_queue_send_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "update_case_queue_send_conn_str" {
        id                      = "https://ethos-shared-aat.vault.azure.net/secrets/update-case-queue-send-connection-string/6922b4412d1e4fc28d5287101b8f0029"
        name                    = "update-case-queue-send-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat"
        name     = "ethos-aat"
      ~ tags     = {
          - "Destroy Me"   = "No"
          - "Team Contact" = "#ethos-repl-service"
          - "application"  = "ethos"
          - "builtFrom"    = "https://github.com/HMCTS/ecm-shared-infrastructure.git"
          - "businessArea" = "CFT"
          - "environment"  = "staging"
          - "lastUpdated"  = "2023-10-04T17:11:11Z"
          - "managedBy"    = "ECM Project"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.application_insights.azurerm_application_insights.this will be updated in-place
  ~ resource "azurerm_application_insights" "this" {
      ~ daily_data_cap_in_gb                  = 100 -> 50
      ~ daily_data_cap_notifications_disabled = false -> true
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.Insights/components/ethos-aat"
        name                                  = "ethos-aat"
        tags                                  = {
            "application"         = "ethos"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/ecm-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ethos-repl-service"
            "environment"         = "staging"
            "managedBy"           = "Ethos Replacement"
        }
        # (14 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + name                = "Application Insights daily cap reached - ethos-aat"
      + resource_group_name = "ethos-aat"
      + scopes              = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.Insights/components/ethos-aat",
        ]
      + tags                = {
          + "application"         = "ethos"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/ecm-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ethos-repl-service"
          + "environment"         = "staging"
          + "managedBy"           = "Ethos Replacement"
        }

      + action {
          + action_group_id    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = "CHB46SFNU"
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.Insights/components/ethos-aat"
        }
    }

  # module.ecm-create-updates-queue.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "ethos-sb-aat"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "ethos-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.ecm-create-updates-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/create-updates" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "create-updates"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat" # forces replacement -> (known after apply) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.ecm-create-updates-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "ListenSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.ecm-create-updates-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/create-updates/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/create-updates" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.ecm-database.azurerm_postgresql_active_directory_administrator.admin will be destroyed
  # (because azurerm_postgresql_active_directory_administrator.admin is not in configuration)
  - resource "azurerm_postgresql_active_directory_administrator" "admin" {
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-shared-ecm-db-data-aat/providers/Microsoft.DBforPostgreSQL/servers/ethos-shared-ecm-db-aat" -> null
      - login               = "DTS Platform Operations" -> null
      - object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> null
      - resource_group_name = "ethos-shared-ecm-db-data-aat" -> null
      - server_name         = "ethos-shared-ecm-db-aat" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.ecm-database.azurerm_resource_group.data-resourcegroup will be destroyed
  # (because azurerm_resource_group.data-resourcegroup is not in configuration)
  - resource "azurerm_resource_group" "data-resourcegroup" {
      - id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-shared-ecm-db-data-aat" -> null
      - location = "uksouth" -> null
      - name     = "ethos-shared-ecm-db-data-aat" -> null
      - tags     = {
          - "Destroy Me"   = "No"
          - "Team Contact" = "#ethos-repl-service"
          - "application"  = "ethos"
          - "builtFrom"    = "https://github.com/HMCTS/ecm-shared-infrastructure.git"
          - "businessArea" = "CFT"
          - "environment"  = "staging"
          - "managedBy"    = "ECM Project"
        } -> null
    }

  # module.ecm-database.azurerm_template_deployment.postgres-paas will be destroyed
  # (because azurerm_template_deployment.postgres-paas is not in configuration)
  - resource "azurerm_template_deployment" "postgres-paas" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-shared-ecm-db-data-aat/providers/Microsoft.Resources/deployments/ethos-shared-ecm-db-aat" -> null
      - name                = "ethos-shared-ecm-db-aat" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "administratorLogin"         = "ecmconsumer"
          - "administratorLoginPassword" = "ztw!}OtwWk3C_HsX"
          - "backupRetentionDays"        = "35"
          - "charset"                    = "utf8"
          - "collation"                  = "en-GB"
          - "commonTags"                 = "eyJEZXN0cm95IE1lIjoiTm8iLCJUZWFtIENvbnRhY3QiOiIjZXRob3MtcmVwbC1zZXJ2aWNlIiwiYXBwbGljYXRpb24iOiJldGhvcyIsImJ1aWx0RnJvbSI6Imh0dHBzOi8vZ2l0aHViLmNvbS9ITUNUUy9lY20tc2hhcmVkLWluZnJhc3RydWN0dXJlLmdpdCIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImVudmlyb25tZW50Ijoic3RhZ2luZyIsIm1hbmFnZWRCeSI6IkVDTSBQcm9qZWN0In0="
          - "dbName"                     = "ecmconsumer"
          - "dbRules"                    = "W3sicnVsZV9uYW1lIjoiY2Z0YWtzLXRmLWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvOTZjMjc0Y2UtODQ2ZC00ZTQ4LTg5YTctZDUyODQzMjI5OGE3L3Jlc291cmNlR3JvdXBzL2NmdC1hYXQtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1hYXQtdm5ldC9zdWJuZXRzL2Frcy0wMCJ9LHsicnVsZV9uYW1lIjoiY2Z0YWtzLXRmLWFrczAxIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvOTZjMjc0Y2UtODQ2ZC00ZTQ4LTg5YTctZDUyODQzMjI5OGE3L3Jlc291cmNlR3JvdXBzL2NmdC1hYXQtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1hYXQtdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiYXNlIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvMWM0ZjA3MDQtYTI5ZS00MDNkLWI3MTktYjkwYzM0ZWYxNGM5L3Jlc291cmNlR3JvdXBzL2NvcmUtaW5mcmEtYWF0L3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY29yZS1pbmZyYS12bmV0LWFhdC9zdWJuZXRzL2NvcmUtaW5mcmEtc3VibmV0LTMtYWF0In0seyJydWxlX25hbWUiOiJha3MiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYzRmMDcwNC1hMjllLTQwM2QtYjcxOS1iOTBjMzRlZjE0YzkvcmVzb3VyY2VHcm91cHMvY29yZS1pbmZyYS1hYXQvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jb3JlLWluZnJhLXZuZXQtYWF0L3N1Ym5ldHMvYWtzIn0seyJydWxlX25hbWUiOiJqZW5raW5zLWFrcyIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFiYWY1NDcwLTFjM2UtNDBkMy1hNmY3LTc0YmZiY2U0YjM0OC9yZXNvdXJjZUdyb3Vwcy9jZnQtcHRsLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jZnQtcHRsLXZuZXQvc3VibmV0cy9pYWFzIn0seyJydWxlX25hbWUiOiJqZW5raW5zLWFrcy1hZ2VudCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFiYWY1NDcwLTFjM2UtNDBkMy1hNmY3LTc0YmZiY2U0YjM0OC9yZXNvdXJjZUdyb3Vwcy9jZnQtcHRsLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jZnQtcHRsLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1zZXJ2aWNlcy10ZXN0LWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvM2VlYzViZGUtN2ZlYi00NTY2LWJmYjYtODA1ZGY2ZTEwYjkwL3Jlc291cmNlR3JvdXBzL3NzLXRlc3QtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL3NzLXRlc3Qtdm5ldC9zdWJuZXRzL2Frcy0wMCJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLXRlc3QtYWtzMDEiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8zZWVjNWJkZS03ZmViLTQ1NjYtYmZiNi04MDVkZjZlMTBiOTAvcmVzb3VyY2VHcm91cHMvc3MtdGVzdC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtdGVzdC12bmV0L3N1Ym5ldHMvYWtzLTAxIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtc3RnLWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvNzRkYWNkNGYtYTI0OC00NWJiLWEyZjAtYWY3MDBkYzRjZjY4L3Jlc291cmNlR3JvdXBzL3NzLXN0Zy1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3Mtc3RnLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1zZXJ2aWNlcy1zdGctYWtzMDEiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy83NGRhY2Q0Zi1hMjQ4LTQ1YmItYTJmMC1hZjcwMGRjNGNmNjgvcmVzb3VyY2VHcm91cHMvc3Mtc3RnLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9zcy1zdGctdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiYmFzdGlvbi1ub25wcm9kLXZuZXQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy9iNDRlYjQ3OS05YWUyLTQyZTctOWM2My1mM2M1OTk3MTliNmYvcmVzb3VyY2VHcm91cHMvYmFzdGlvbi1ub25wcm9kLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvYmFzdGlvbi1ub25wcm9kLXZuZXQvc3VibmV0cy9iYXN0aW9uIn0seyJydWxlX25hbWUiOiJpZGFtLWFhdDItdm5ldCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFjNGYwNzA0LWEyOWUtNDAzZC1iNzE5LWI5MGMzNGVmMTRjOS9yZXNvdXJjZUdyb3Vwcy9jb3JlLWluZnJhLWlkYW0tYWF0Mi9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NvcmUtaW5mcmEtdm5ldC1pZGFtLWFhdDIvc3VibmV0cy9jb3JlLWluZnJhLXN1Ym5ldC03LWlkYW0tYWF0MiJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLWRldi1ha3MwMCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzg2N2E4NzhiLWNiNjgtNGRlNS05NzQxLTM2MWFjOWUxNzhiNi9yZXNvdXJjZUdyb3Vwcy9zcy1kZXYtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL3NzLWRldi12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtZGV2LWFrczAxIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvODY3YTg3OGItY2I2OC00ZGU1LTk3NDEtMzYxYWM5ZTE3OGI2L3Jlc291cmNlR3JvdXBzL3NzLWRldi1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtZGV2LXZuZXQvc3VibmV0cy9ha3MtMDEifV0="
          - "env"                        = "aat"
          - "geoRedundantBackup"         = "Enabled"
          - "location"                   = "UK South"
          - "serverName"                 = "ethos-shared-ecm-db-aat"
          - "skuCapacity"                = "2"
          - "skuName"                    = "GP_Gen5_2"
          - "skuSizeMB"                  = "51200"
          - "skuTier"                    = "GeneralPurpose"
          - "sslEnforcement"             = "Enabled"
          - "version"                    = "11"
        } -> null
      - resource_group_name = "ethos-shared-ecm-db-data-aat" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "http://schema.management.azure.com/schemas/2014-04-01-preview/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - administratorLogin         = {
                      - maxLength = 16
                      - minLength = 1
                      - type      = "string"
                    }
                  - administratorLoginPassword = {
                      - type = "securestring"
                    }
                  - backupRetentionDays        = {
                      - defaultValue = 7
                      - type         = "string"
                    }
                  - charset                    = {
                      - type = "string"
                    }
                  - collation                  = {
                      - type = "string"
                    }
                  - commonTags                 = {
                      - type = "string"
                    }
                  - dbName                     = {
                      - type = "string"
                    }
                  - dbRules                    = {
                      - type = "string"
                    }
                  - env                        = {
                      - metadata = {
                          - description = "The tag"
                        }
                      - type     = "string"
                    }
                  - geoRedundantBackup         = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - location                   = {
                      - allowedValues = [
                          - "UK West",
                          - "ukwest",
                          - "UK South",
                          - "uksouth",
                        ]
                      - defaultValue  = "UK South"
                      - type          = "string"
                    }
                  - serverName                 = {
                      - maxLength = 63
                      - minLength = 2
                      - type      = "string"
                    }
                  - skuCapacity                = {
                      - defaultValue = 2
                      - type         = "string"
                    }
                  - skuFamily                  = {
                      - allowedValues = [
                          - "Gen5",
                        ]
                      - defaultValue  = "Gen5"
                      - type          = "string"
                    }
                  - skuName                    = {
                      - allowedValues = [
                          - "B_Gen5_1",
                          - "B_Gen5_2",
                          - "GP_Gen5_2",
                          - "GP_Gen5_4",
                          - "GP_Gen5_8",
                          - "GP_Gen5_16",
                          - "GP_Gen5_32",
                          - "MO_Gen5_2",
                          - "MO_Gen5_4",
                          - "MO_Gen5_8",
                          - "MO_Gen5_16",
                          - "MO_Gen5_32",
                        ]
                      - defaultValue  = "GP_Gen5_2"
                      - type          = "string"
                    }
                  - skuSizeMB                  = {
                      - defaultValue = "51200"
                      - type         = "string"
                    }
                  - skuTier                    = {
                      - allowedValues = [
                          - "Basic",
                          - "GeneralPurpose",
                          - "MemoryOptimized",
                        ]
                      - defaultValue  = "GeneralPurpose"
                      - type          = "string"
                    }
                  - sslEnforcement             = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - version                    = {
                      - allowedValues = [
                          - "9.5",
                          - "9.6",
                          - "10",
                          - "11",
                        ]
                      - defaultValue  = "9.6"
                      - type          = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - kind       = ""
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('serverName')]"
                      - properties = {
                          - administratorLogin         = "[parameters('administratorLogin')]"
                          - administratorLoginPassword = "[parameters('administratorLoginPassword')]"
                          - sslEnforcement             = "[parameters('sslEnforcement')]"
                          - storageProfile             = {
                              - backupRetentionDays = "[int(parameters('backupRetentionDays'))]"
                              - geoRedundantBackup  = "[parameters('geoRedundantBackup')]"
                              - storageMB           = "[parameters('skuSizeMB')]"
                            }
                          - version                    = "[parameters('version')]"
                        }
                      - resources  = [
                          - {
                              - apiVersion = "2017-12-01-preview"
                              - dependsOn  = [
                                  - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                                ]
                              - name       = "[parameters('dbName')]"
                              - properties = {
                                  - charset   = "[parameters('charset')]"
                                  - collation = "[parameters('collation')]"
                                }
                              - type       = "databases"
                            },
                        ]
                      - sku        = {
                          - capacity = "[parameters('skuCapacity')]"
                          - family   = "[parameters('skuFamily')]"
                          - name     = "[parameters('skuName')]"
                          - size     = "[parameters('skuSizeMB')]"
                          - tier     = "[parameters('skuTier')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "Microsoft.DBforPostgreSQL/servers"
                    },
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - copy       = {
                          - count = "[length(variables('dbRules'))]"
                          - name  = "storagecopy"
                        }
                      - dependsOn  = [
                          - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                        ]
                      - location   = "[parameters('location')]"
                      - name       = "[concat(parameters('serverName'), '/', variables('dbRules')[copyIndex()].rule_name)]"
                      - properties = {
                          - ignoreMissingVnetServiceEndpoint = true
                          - virtualNetworkSubnetId           = "[variables('dbRules')[copyIndex()].subnet_id]"
                        }
                      - type       = "Microsoft.DBforPostgreSQL/servers/virtualNetworkRules"
                    },
                ]
              - variables      = {
                  - dbRules = "[base64ToJson(parameters('dbRules'))]"
                  - tags    = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[0] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "9011137838582413130" -> null
      - triggers = {
          - "rule_name" = "cftaks-tf-aks00"
          - "subnet_id" = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-00"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[1] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "3754486500497078511" -> null
      - triggers = {
          - "rule_name" = "cftaks-tf-aks01"
          - "subnet_id" = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-01"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[2] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "7366486803465662638" -> null
      - triggers = {
          - "rule_name" = "ase"
          - "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-3-aat"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[3] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "4498959096617376038" -> null
      - triggers = {
          - "rule_name" = "aks"
          - "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/aks"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[4] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "8876781570829473500" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[5] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "7211874296034587503" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks-agent"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[6] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "657163396893797493" -> null
      - triggers = {
          - "rule_name" = "shared-services-test-aks00"
          - "subnet_id" = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet/subnets/aks-00"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[7] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "3574394692061182652" -> null
      - triggers = {
          - "rule_name" = "shared-services-test-aks01"
          - "subnet_id" = "/subscriptions/3eec5bde-7feb-4566-bfb6-805df6e10b90/resourceGroups/ss-test-network-rg/providers/Microsoft.Network/virtualNetworks/ss-test-vnet/subnets/aks-01"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[8] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "6561983930398589052" -> null
      - triggers = {
          - "rule_name" = "shared-services-stg-aks00"
          - "subnet_id" = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/aks-00"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[9] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "6798810646075361666" -> null
      - triggers = {
          - "rule_name" = "shared-services-stg-aks01"
          - "subnet_id" = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/aks-01"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[10] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "4404710710767000176" -> null
      - triggers = {
          - "rule_name" = "bastion-nonprod-vnet"
          - "subnet_id" = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet/subnets/bastion"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[11] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "8834457571103065466" -> null
      - triggers = {
          - "rule_name" = "idam-aat2-vnet"
          - "subnet_id" = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat2/subnets/core-infra-subnet-7-idam-aat2"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[12] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "8573725635257688555" -> null
      - triggers = {
          - "rule_name" = "shared-services-dev-aks00"
          - "subnet_id" = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/aks-00"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[13] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "6368761154529632889" -> null
      - triggers = {
          - "rule_name" = "shared-services-dev-aks01"
          - "subnet_id" = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/ss-dev-network-rg/providers/Microsoft.Network/virtualNetworks/ss-dev-vnet/subnets/aks-01"
        } -> null
    }

  # module.ecm-database.random_string.password will be destroyed
  # (because random_string.password is not in configuration)
  - resource "random_string" "password" {
      - id          = "ztw!}OtwWk3C_HsX" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "ztw!}OtwWk3C_HsX" -> null
      - special     = true -> null
      - upper       = true -> null
    }

  # module.ecm-update-case-queue.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "ethos-sb-aat"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "ethos-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.ecm-update-case-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/update-case" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 256 -> (known after apply)
        name                                    = "update-case"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat" # forces replacement -> (known after apply) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.ecm-update-case-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "ListenSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.ecm-update-case-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/update-case/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ethos-aat/providers/Microsoft.ServiceBus/namespaces/ethos-sb-aat/queues/update-case" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

Plan: 7 to add, 6 to change, 27 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":68,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->